courses TestSuite/not existing course test request

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://kodilla.com/courses/soap">
    <soapenv:Header/>
    <soapenv:Body>
        <soap:getCourseRequest>
            <soap:name>Python Developer</soap:name>
        </soap:getCourseRequest>
    </soapenv:Body>
</soapenv:Envelope>